<?php
/***
Site		:	http://www.tool.eddiekidiw.com/phpobfuscator-v-02.html
Date		:	2020-04-07 Tuesday 23:42:38
Ipaddress		:	36.90.160.188
City		:	Cigugur
Country		:	ID
Region		:	West Java
Organization		:	PT. Telekomunikasi Indonesia
User-Agent		:	Mozilla/5.0 (Linux; Android 9; Redmi 4A) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.162 Mobile Safari/537.36
***/
if(!version_compare(PHP_VERSION,'5.6','>='))exit(eval("\x65\x63"."h\157\x27\x52\145\x71\x75\151\x72\145\163\40\120"."H\120\x20\x35\56\66"." \x6f\x72\x20\150\x69\147\x68\x65\x72\x27\73"));$ŸËÂû“ ="\x67\x7a\x75\156\143\157\x6d\x70\x72\145\163\x73";eval($ŸËÂû“ ("x⁄µU·k a Ó Ë?ã»;º”Pozö‹^à˛á>- 3≠
Q∏ ,∆æm¥¬Õ Èß0Ü¡ Ål£ jA[Èÿ§5¨%ãX e[€‹>l%B–{Ô˚ﬁyw Âó>yøﬂ=øÁy~œ˚‚9m« 3È3¶êÕ  äÖ  Òòy©ôNÌº`¿QÛ”ÿ¸6; &èõÖb éÁæﬂOû2˛Û¨@[ hπ<ÏÂ,Ìöb8é◊Å¯N Ô—b‹ûNåø  ésÈ@n# ß  ®q.  √â!1F_)) £J>   ˆWvv∑P>µZ˘qÆÆ(ì“ C7Dƒ(-)w ¬◊kë HW·Q)ºœ‘ø.' 0˘lzıÂ!R(U
çßo±Ç )êRe[JInJ†ê à”Ç¯à »≠c‚
@ú˜ﬂL~øé»H
 ú
‰Ût·€ Ó¬íœ-«læ@˚Jú™† rsc3  d©˛cÔ  ù\\œn§ˆ± :(Z∂óÚ±Ì U—cà_ »ÌÌ ÒΩZ N∞É»• ·≥–;ÚÎ0› —;H∫J ™h∂>øZ|◊`@±ıº6  ‹[´ﬁNBÎù¡7¶KS û≥{∂ASÊ‚Ï@u™deGÆG„WÉQ3ÿﬁ˝ñ≠¨ d “ír    Z”ehµ
`Æµ˘®
É¢ º≈† ≥øÛ )Ë FV ∞|7=^Ä7 b4 cà0Ç‰W ù4î.eåƒE  ŒdWäh ç‚«>B'ÿÌ§F«äÂ˙I Ä‰ Ì*M >.ñè`7\$ I'ÏZN{\\ºFΩ“V Ÿ#¿≤=î
|Ÿ,ΩûÄ⁄AAÔçñX§˝ñîêPPÁƒ≤º@æÚsa
\"˚¯°è‰%Ÿ«5≤O‡tÃŒµm˝mØˇ`û‹  \$gÿO¸ ÆHˇñtÄ—e´Âë- –m•∑ 3
£N'˙ê˝ ¯≤tù"))^eval($ŸËÂû“ ("x⁄”◊ˇ0 ⁄‘GS◊>ÍX˘hÍ: ÈdÆî‘¥ÃºT
ıÎÛ„ü>{pN]'µ¢ '?%UC)∆‘@I'>ﬁÕ”«5>^«†¬H3⁄†¬  b5≠U÷6ŒﬂıkôÌ’; 6ù ß°^qÎvÂVµ¿/åÈy∑æπˇ”b W€ ’∑j«’}%”~⁄Œœœ›Á;7Gã¡‡å¿nu†Ó∑≥˙&ú=f´ clf Sëf cdl d ƒ  õ«   )Y´Ã›qÆw˙ \$ ¢ ÌM  ÿ≤ô|A&¥<Ïõπ í¥ˆïô{ˆ:r2pJ3u  ËkÅ¸
Ù¢ñ> Z†is"));$§˘Ê·ù¬=new$ÌöéêÕ∆("›·ˇÒ™æ…ÅºÅ˚∆≥ÜÉ•Ã–œ§éëä¶´Íá‚ˇ‘Å»Õ’·ø˘æÈ˙çË˝ØÄ∞≈∏°î∫ëÃé¸≤ïﬁ ¬Ø¬Çß¡…å™Ì·‹Â”¢ØúÒÚ’ò»°·¿œÙÓ˝™”ÈÈÃ÷Ãæ±õ‘õÑÁ∂«˛¸û”ˇÖı‰‰˘ÇÉ®Ïà‹ßÕÄŸøÚƒÂ˜¶ﬂ∂ó∞ƒäõ±àΩö ∞Ö¯ﬂ¸–ß");eval(’‹¿≤œÓ('x⁄ ≤ M˛ÛÇ¸íÏ éäÆ& íµ± õ> Ï¢oi¿áe”6,”∆œ õ˝◊é¢ØŸ⁄ %Í›| ∆Ÿ@(œ x1é —´Ñ\'Ù``ªr04ñ< âveññ¶k©\\¿"∫ùaFÖUªZ’æ;†ñU; Q[˜À‡‰ßº„‘≤ÏˆKA∆ ©œ≥Œ√oÖ÷ˆäX∫	—@E´ xÕ±åhN∞ˆÆ Z˛∞y ¬aQÿL∂•®ÌA÷HXCäo  u]T« _   X»éÅçm«º Sœ¨oad<8-  ΩmêTtEM6ªπ= >x˚;‚Ë´2A6l:?v÷w2 ÁWïmD∆ î6’gê∑E "’€q9z¯m ÀÜÕ i}— LCäÀ≈#Næùˆ$˛ñåî¬Ô∆l ﬁ†èmó ˆƒá[Äô ≤ÙÛ „ÍÿúÜ
Ù_›–∂5‹Q è?K Ê}Eä 
W˚¸Vm¥~ Û£GIërWu≥ı∂4ìª|9»Q— TëÆBÍë◊Vyh n LC]\\ÍsmûΩ⁄cDoﬂ¬ZÈÜdªè¡~∂ˆ◊}]àç™ ë∫ _
 Ö. íW |\\&ﬂwË8j ˘æóº≥£µ™&ÚÌwd ÚF 7±Dﬁ‹-'))^error_reporting(1|2|4|8192)^eval(’‹¿≤œÓ('x⁄ ⁄\'%ÿÛÇ¸íÏ éäÆ& íµ± õ> Ï¢oi¿v`˚a}Ô$¿G9&)X ¡ﬂ-jy  !∂ üöZ º∏…Ò˙Q
õ 4›F™„™o#∆¶◊\\ ÷¢svæ˝ô ø4†hÑ†ª!¥  &∞üL  ®(`° f ^u “ aÈ5 ∆ 7·ÍP•∏` Ü<Ñ˛∫Üì’ç tóÆ"∞¶6!âåMEFko≤)µ…Äeˇå/Nt… Q‡ko˘^™Œ‘⁄∏pw53ˆõ âÇ §*f y6sï∆Çë˜ ¿   ŒıÓ‘¸˚˛¯/ ˝Ω˜√;=ï¯CÇÓê^Î£BlrTXœXaÂ ≈!Ìº–P≈æ1|y ıŸ¶ ÌÙNÃÔxmÒëd>ª6¯owÆ uºcÀ∞ ﬂ kËo µÉú•.¶œ≥èP2 ¢Úi∆‘ëÁÏÙ~ ¸oˇ∫ò%â Òüüå B®µ®!…§¿+¿h¶Òèø‡ãëj&/p(  üiÀS˙Ïﬂÿdéæ Ç µ-YïÛ- T¨«£π¨ .^ê√§ * è¡Ë J∑1ﬂ!DÎ}âKT’Ô†ìÌ 4xeMÌ¢f¢î$JG˙8 µˇ~ Í Ã£$˛ZT,<h|ã∫òÈ¶œƒÃ p ¸ºoÀüå Y h‡<	æV>Ü Âø≤üMaÁ’’ñLò»’k ∆.0ÆÄ√Ñ TFI ƒMDˆ  P”
Ÿ£íz @¢àv˚Ä!6û•Bf ÙÂi√X ’Ò
A›∫W ûz÷tln40ñ}ö Gß# ˇ \'+MÂ` ~ «p“oKÄΩ∂ –a≥ Ù7Ê7é›ûtŸÌDﬂË ∆ı¯ó0ﬁ3õ Ä®≠ ¡ X¶aÅâ≠¥ Hô )æ3  Ï¬˙ Óâ“3+Ω∆io7zø:+X>ú¥fè ¯ Ú"A∑£]ˆ,˘" ®ôÜ$¶ ò•  ÆÍ…}›·V ìÄ¬¡ß∑>«“ácg∂àt.ú>’“∆p•¯ä∞WﬂÄÚ#ﬂ¬Zo ‰|*˘J≈ Î
á\' 00⁄ 	|œ+˙	’ "‰¬˛J¬Úkek◊⁄ß·˘ ˙~“Æ≤µ Ùﬂkh<g m¢wV§7≠ ßÔÀ“Û˚>`k<íÙ^‚x9 zD-Ü‚ † ›“∞[û§¢{ ø¿§ a¨jÚ 8Õ∫	ÚÈVÊ- ÿ  ê/ÏÜî|Ã ´€ü˙Áˇ˘^ˇ(ÙJ[eÜ∂ÆÍë1™  ¡‘ 0⁄ÕÒƒ~  à  ÆYm µ§Yp›∂yU‘cîæ já- sœÊ¿    l ^Åèäaf~  «ºvõÚ≤…ÇëM}¢ í-ƒÔÅûœks©ÿ €N¶4´–ÜÒ •fÎÛõÀ£‹Få<Ä3c_h,ÁÂÄ¡¸ã:$äêSª§√Ö∫ N¿ ZßÇ‘f §∑í fPÉî _ê] .@§BëŸ \'
q÷ ∂v»)¸E%^H^ ∏Æ⁄Í_9ÏøÈ€rÃ ÕÕ˝¡ä5T§dî| ÷ ∫îÈ &œ9kx]Ö
,∆∑uÖ´Q“/  /L—L©˜ ›\'  S\\
§†X™Œ°Œ…— ÌfÜ˘¶kxn¨O±®Ô|  oä#ï ˙ ƒ‹]{“g	75◊˛°ÚH™Ï¬dﬁ˘ÿ Å≠øH
ÄÖF8 ¥«äKÃ†º»=ØÌØ˙´âOMYûñç≈  [w®Èb˘¥DA›=¬ ;å=à æ æ§¯á i+NùÕ  :^: ƒ´Uç˝ÕH Mwj˚@˛möﬂ ö:xõ‚≥ Éå$ ê  ” …¨7R™á@û´ZÃ
îxd’É ´•T¿y#Ö7íÊT(Ï9åTÈ…⁄‘ÜÁ"W>ÌB¡tµDÄ±Á{s ="˝ÁØ1ï `^júœÁ5\\@ "äæ≠ãv O¢eÔ≥]i/√˜! íÈ!ˆqá^ŒßÆ„µ.Sê¨∫ Í ≥ ·•òsOp §¶UéÆ“À⁄$e˘ &:IbÁ ‡v≤-T ®Yd π TŸ ∆aøÒøtf B> • ?îHΩ(‡<S≥Ê3‰Õ !l*£îsq¨ƒÅ˛WäÚo≠˛Âùˆ |Õˆ˝Èä˙ÜMg Ÿ‰…ºåê hÁe∞†q‹wC∆É˙–RÀQ‹*wá∫äJº ˝{	ık ØÕ1mì˛ WY‡ Œ∏ A8RfE˝  zÄEñ™5ViÃºN÷  §¢ÙÛI¢584òi±\'} ´¸°LÈg j£©⁄ò_ ™
ÇÈ
1jôAyTƒç"Ô HùIŒ¥’-PÊ∞Y…7  ˇÀ≈vHœJﬁEzdAs¿ú2--â¬\'¸% …ÜRÆ‚9#0Q  á  ê´“Úé©∏0Ÿ5˚¶ËåàsD @3 †p~*Ó [>À9bX VˇP0 µÌ∞ê¸o §˘!\'Z{à‘ ó¶ãëÎÁ◊%ç0Å∆î>  ∑ä«¶R k≤‰≥íÃï¢ãÂ¨ï ≥£ 	YÑëLñ?(õ¨1Z,
≤O_√Á»3®òµÕCL#L˚p—…ÕQuºa1ö? ± @î   ¿ πL ò„¬Ç¥e;ˆ+⁄nI%1©2 ¢∫Y{?§Ω¨Œ™ π V´‰Ê\\≥y}»=¯¢ ƒÔ* u#|å/xèä˛+bÓgôé®Ï@±¨f %`˙“ ˝Ç	¸·´VKô√ÇèÕVkêu%bû ˜ç÷f)ó∞ˇ°∏œ ‡|9D∫2<”˘≤Å
˙ 7ÆüÈáîÍ Ù6ä;—9pè9•r>M \'ÿ≥4¬‡}v» ∏66Ê™c T ì!B ;%;´xqÑË“MèÀ Q˜Í(E‹ô ~∞H)°É´EÓøUÖﬁ$Ä(Œ˙ ò›Äè÷˜\\ “˘Ôg*Ï!ø∞∑Å‹\\Z ÉJ© sû⁄·3–˚# w<(có Ç  `y˝ı  eù8ºÓri±¿YEV –« Aa&Å´¸ÍÚ5 | +cÆﬁnSä‘ö ÑÊz ûW‰fØÔºãbÄí,A e∏Æ¢3ëröZ(’›e÷ ñ¸Ü´≈3[àÙÈCÔ Ï¥–PuåM– ¡Ç Ñâõs6Øò‰¡‰ØË¥6º˘ı/¿∂`lﬂì _Ÿ6e í®n7 ˚%º Xk\'Ø™ñÕ¨¯$òãˆd vœÿÓ“!À6  9:º zd◊Jﬁàòõó Y ‚H¥=0ñã!Q]lÒÚn ≈ ˜,ÄU†E ì UÔ(ƒÉ´˜œ˘ærΩÍF8 Ä÷ €áäX£ ∆   ı,òMuYJõV ƒPÇï¡ÙJ@±—}∑É+√˚éÊkª  7yè…ı- ;Yé≤∆Õo @˛<yêF®Æé Yª¯	o9µ`Êır•o6£ﬂ±UÌ·±Ín/∂@îõ< —∂ü = »V‹ ôîçñ©◊,  äﬁ‰ô™ `≥ÔhLc ] èG ¯T M¢‡∫)%Ç∞òªº6˝qá 9j Qƒ≠z_ô}  ≈îT  {m}[ìpwâ§09#$€ ñ>\'§Ã7  ö|ëªI≤ÃÎ0 A^Œ§O¶Ç§)π‡Ø$wÕ≠æ ËÕ±sÍîE  nJéD 8≤kÊ‘gÌl 0˛’úe+u9åÊ‹
h6¸ıç+Ïøíå|   :æPî“ØöL  @·†À#ê1x◊ã e¡ﬁ
üU@  n™ÁcnÓ¨Õ"!Ñb;™/ Ôn?Ê|c»!L†_Ì)¿— =æh’x…\\?W™µüló ;á_ @É›·÷ò‡cƒøﬁD8ˇ 	√z5}*G˜ÚÅd–©Ù ˝fL.µíÈùïß_ó∂Í˜u‚∑·˘ [C+ 	˙õ»UOFÏyü$ †R(‘ yﬁÎNiå_áãv ∫bÉ’˚  O.–oò¸? ıxêèf*Óä~z∫K¯îJ u˛;ÉÆ NW˚Ä º`Ã§M
œë∞Û≠|ûlH1É= ñË"äŸ˙ô à±[ã÷i-
À¶Ω¢ò ÉóŸÿ |W¥ ‚1‚ÒZÌ †«0N^∫ÎhÛœ‰ MõÊØﬁ=a¯ Äî%gô eH≤$<x‚Õáúıe  -ı6G¶WW¬8`K)üçïx6 H§›∆R éi{ä^YNiπq˙-V?8Ø ≤⁄ç`;c≥µ¡Œç¯œ≠Åë&8[◊|,o_◊0è¯rwª*±2¬©ep   NΩä_ H %.¸t
, è+ca´ D"Ú&b:„Ÿq óç/oTÛ´QNÜ· √≠ Ñî	  ‘_,Ëø&<@0ÚÈ;O= d[ ≤ËúãÃÙz«lr®ÓÀdÌ» à * ç åF¿4%_´ bΩ~— ~EË¿ˆ£µ ÎjµãYÃ]´Ä°]ˆFi3ëç& OjÍ¢-Ù`(h%«àØwõ4ßt©ôo— úKÆ\'*É≠&(GÇFÏº „dÎ
8^ ¡xèö·pbíy≤n}/Wﬁ! ·UÄvt˜Òˆ Ò¶v.ÓË |óûB»0
€¡s ¯ ∞  Àüî c&¬L¸ÏIN F5¿  0ÿ–k¢ùr¢ (`√˘e9ﬂïÌ‹‚ ¡∂Ÿ É	Í≈D!rTíÂæo8 }õPŸ  % h ¶1y’ ~ö" ÖìõV%É‹T Ω∆Ï *Ø∫†√˜”r°‹˛tî¶∂–ÑY‹‹
cµ˜Áe
¸÷ ù–[›¬ —’î B:Òg&özI©ì Ntå ï  ˙4m— Òf…G>bA~ ó`( ãg[5i}1 ·!  ªªîJû]`©¸3πù%“~~ ùø≠àl⁄B ı‡ü[Â1Ç%v ”≤ÇhÔg€û  \\µ ?Ÿ∑ö∂Úu\\›(T¢∂ç[`^â◊b\'>5µ +2R]»ˇz …€Õ·∫)_kÄ ﬂv‘‹,‚ﬂÑ2<· õœDnÆÅÄ+OTßáOdç)ªE0ÚxM√-"◊’ııÃ∞£‹_%öEj¨Ûç Èh&N#¸∏Â ÁìDd≈ã•Œ:ì € ÂÒÊ  b‘“€mﬁä%  »» ò –ﬂ3‡í  V
wQƒ i°ÿßKWr∆t lŸµ‰∂vüàıx†Øy– +H¡u — ãí®ÔQÔ‚|ÈH î_ûÁæ!?x ™ˇ›ık˙\\ ´,ÌÜπ ›VΩ ¡´.Âú èªÖê ´ È?⁄˘û Æ‰0 œúû¢€∫ 9≥d  Ç¬@∏O¸_?	˙ÇıC   ëæOrº5z cÄˆvÁê‹S-Ã®ì*Õ∏ “KL&86)ps@D
‚$è±"JıNr°œù∆kó<é’9Ö(NXô  ˝›˚˚¿¯Á,%  o»È∫ªÙzwTÅÈn™Jo°-–uãÏÇú`´xV "ëòU4›Òﬂ$ë‚aé]ˆ Ë ùw/ ›%;A† ™¶÷◊r4Y Ôœ Yå∑›≥Môi S` Äcˇ∑*ı*,ñé yod¬7r9 ) ; øÓÀãî ∂4bãk Hà9^dM\'πô¯ÕdÆ/’Ú√¡≠ N≤ÔûÔ⁄k÷„œ.0Â‘}à≥:‚˛»\\	æ 0—–!˙ÁéıËlÔC{Ñ≥,ìÅ≠∏“®ü ¶ ΩG- TV/$ﬁ8 W]èo÷√∂÷)p=Ú›R%«⁄´=WÛE u«1—  zE∫øÑœFÅ ÚÂß~ﬂÛ9Xµæn6ö∑Ò†ü∂ñG ,–›´#)(◊jÁ;ª d·Ì#ÎT@ﬂÂ*Û´Gœ i·Wn_2º…◊u{ e„‚†\'ûÒFØâG∞…jΩŸ€Ã≈≈}Êmàv¡*}û∂ıÃÍ } ÷ ⁄ #ÆƒnÆ››∏D‡›Î‹’yS  nn,∫π€i–∏i ŸÑÄ ó» ¸ï„q¨ëØÙ ó 8™Ÿ` q∑  	Á¢Å Âjå å¸[´fœà˘wû}òÈƒ}›∫»Ën·?wC’C1≥IÁ¶BˇπqË
∂Óç8 Y«g˘Úe ˝•í9µ=wgq∑`›Xl>ãZ§¥ ›z>à⁄˝ 	4^Mƒ#iT≈  L  ’≠° ™bﬂ Í¡W˚®¥K6 Gu_˝5=80aKF ôÙcÊt ‹ˆ1)8ÉÃ   ZÜì õÜºå]ûAR ∞ ìÖ 8Zû  i]¢∞ßjáI V"dw|) }9_ª"ïÊ¸‰ c…(£¨Ò°ú^tñ£ Â8 Ö- [ ÅÙS¬1ùÒeï[≥ñ∆ˆ~ÿ∆àív æåáJp¸a ™öÛ–⁄ô |ò 6 ≈1∏æLñ"
8 ¡≠Í∑Ì¸ΩªÇ/% Ï€‰ {Ñ?©IRE¨‡zf)Ü ;1(’ ´é&}Î ¶&Èﬂjh ˛jœ5Y˘g*`ÉP	|Â˝¢≠Œtß ∞‹ÅÔ¨i0 -6d;∏îºÙ9O Yˇ¢ + ˙ˇOf∫˘yësä¯sE Ìh ÃQ™[π_ .@s≥2OËÎ¿sÄ ˛ ´%Â ƒX;Ωà  ˘jáì§ÿ?2π© ⁄   \\÷DD§3p#@l€P0Ë˘ ÿ´Â ¿“õÏ„- [±Y©ˇ Ö,c„ì⁄?ÉÈÊ1…
Ñ>Ê ¬˜ÇV ü†∞≥ Øº&<˙ˆ¬ …åk≤/  `|oì Ç(
 ÷iÓÕS8ÒâIœ◊5
µEJ’PGX·äókèL¢ì
!íuÙØπ ú=–i≠.◊ ¸ı˘s
M à[ u¶I
%è0ËÕ≤ ;¨ 8‰∫”+ µã\\ ~·ù˙»Í°ZKÀD s‡9‹>}û Ï”yï¸Ëa_≤ uå·•#‘U-Ï{odÛzÆ3 œƒiØ“H≤±  WÁˇ †ÀjÍ >?<vÔ∫” ∏dn¶ÿ«¶Z r ] yCM#ß∏[Eã ã®.b9∫ÒA œV2ÊQß Ã±M8‘ ‘û‹ÁHF6€tH-DFπÛÀ¨ã;ò•WÌEøÚ-X›õΩ‹ y◊ÓÁ ü≤ßÊù bø^D ßÎ8 r ¥∂{ò˚›#∞vCË4ÊZ
5S ¡∏‡´*B2á‚,ÍÆ  ◊ÿ >G?æ P84"æ8±3ÒöÓq™∏›ê˙Çı: ﬁÖˆ ïNÌR#àWˇ ë ∂ ≠€ÃJnú¨êº 
˝® [î¯}YòﬁW "(z 8otÏ”∂ÚÂO„7™|ÓÔ .°ÂmaÜ [˘ \\[ˇ„ ˚E~ ¬G£[∏f∞47ßã2wéDVSöáÓ(VY O:À Èbê?5 H’[x, ˝ë ›∆_ˆ2•±`ƒ›µÆ\\æÿï°ıë ¥¶ÈÿEﬂÒª¸#YˇìﬁıQd∑=õF‚ÜÄ*ÆΩq’ËM›‹Ï9)π‹‹9¶ÅD˝ †ÕÎË ©°Ò _™ˇT’“ƒ~ º û∞œ&}˝ã[\\¬ÿj√uìfz”à≥Ó%yëâú©8¥ëu¸< ∏H§ﬂ r> ûà ÛhÖ ã ?¬  § #·Â√ ÍÅπ Cz¢ú¶Üt˚¢ù g˙0
Œ¿ø <°ÑH®»ç±¯€¸… ò„X^©«@ q( ©ß«èÄ
›•_˙#s]#ëb ‰ ¨m‚Ú îe8C› <ë∞¥\\_y°ˇ≥ùâ ΩΩÏÇØ— Õ;d	 x ‰ù€%ÍÖ  ·M" O˙ûqM’õŸKç—V  ŒdMœ e ·˛árl¯˜Í,åÿ 7 õè_HU:¬¶8 •ˆÓ∂æm1/Ó≠ ¡‰˛ /ÿ"F˝∫=›L ¡ 3VM ®gÛøa F˚ ™ ≤——îçø`‘°ÃQ. $ Æe¡z  å?  x®í@v X  …>◊ﬁ!»≈lÿÔñ≈ƒSŒ€¥Êï◊Æ¬À 9”.ﬂßÒ¨ J ¥öÚd≤KPW√ ≥Ìƒ√‘∏^¬˜µ ¨gíeAÒ´PnÈıæƒñaEêNJ©ﬁ; lÃûz°© ˘ìÙ1ãØ„ÍS˜Ór`n≥  bTJ PS˚\\Y<§˘"ÏˆΩ`Wµ√  —3›ÎÃZø9≈˝=ü%ƒSﬂ)WRA sò9rÎ$ûﬁ ¯ âÏ≤â8â∫l¢Q£=Áh¢˝zä≠‹√bë~Ω<:∑Kì/ihmR∏fÏ‡Ã÷r   $6ôUÈÕ É%ıuX«q∏˚WUµ˚HfÅ0úRïË∂≠ ß+ØÃPü√ ‚ ü/π HP’Êú`ek⁄ U £Ä»O
PPΩ<g9ıÎÂåÖÚz  … àƒ LÜˇ~nCû~ Z` ®4+\'’? ºË`•3Xb»∑Hh¶ 1m(<Õ ï≈u J#(|÷i ÍE¥¶ÁOC* “ àŸO‡ ó $A> A¿qœ“œ|œVÈŸëÄ1:¯Ì®ÄØí®MÙ@=ØX˜-Ñõπ”—Ø∆^{ ˘ÑYG€ÉÖø!Õ-
ö,ƒ≤›fC:%ÁµñcÒ◊L 8∑9∂¡ $‚=d$2!4«/∆n™z•éU…”_Éﬂ1õòUõ·ó[ÉñB{l»´¯¿ö@ΩΩ≈_«]∆µ-C=â Ø¶ ‘ 3 s2’8€ô’¯N Yı Ö84%ÀÁ‰Ç ¬	åÏ‡b:√Å   m!/Emß©6’qB-G†cﬂ˜’ç£©}œÔ“Sﬁ Ç/O Â%ÂÆe «UÄÉk” y£*” ß∂^ ∑l Hw 
⁄> ˛Rù  ] ‹∏>9‰~~ ﬂô é  ‹íÜX€}  .ivr˛±Ò.†€OÊ/ æR≈J¯SUÿú VRLsñÆ∫†ñ≤ „X@m ¥t(∑∑ˆ˚)* ÔEx˚o(,õd DŸÿßJ°ê   @  ¨BèÕÌr2!∆]øæ—ïÖ™å |AY º≤ÀtûqÌÃ’≥6<Û^O–ı+\'Û•Ò˜ol VO´∏có
§–∆0¸(+„èF 
Ò‡MƒEá∂˝‡É˙ Á¬ìÃ¥©ÛnOZç {∏ÉÑé%
%ı∏=\\ñO±ü¨^ Y‹cOã √øipYvv Áìí¿ûOﬁ    ˙0˝|Ù«0ÌŸ{ˇ AYHÃq¡ÔKOÛ"ï<ﬁ≤˝†
åñÿ˘û˜ÚAa \\R#ΩıkòG√‚ÈFHs*F5€¥ñ J 5ù±„Nµx¨ nµ¿∑ Ì|µ] 2t€”®Q GT œÒ¶ ın…«=˝˙j A-Âã:{§…  ŒÔ ÷®√Mé˘`lP^Û±oã¨Òß í
 ø ƒ≈·D @êƒ• Œ5Œñ∂Ò[(•K4⁄ßˇRòÅ˝øﬁP•@JzcJ xQ@Ω∂/‘’¸√ û√`.àrö ìÙP<H[≤Q∫8Õ Úv^à≤9

˛ó? ÎmÄõÄte≤íl 0;§ˆˇ ä]U6jo∂âX 2.ËÆóR¶¬"4û ∫òGÂGûÃ-÷‚ 
?ôV  {≈‹ôˇçÿ>Õ24ôÃ¬ßÁØ˘‘
ºGÏ›  $≤ÈÃt ≤SéƒL…ÍeÕÊo»Ü Ahè>‘—”®  ›©åå6Ï`ﬂ ?: Â¿¥¸ä e∂ôr≥ƒPêà˚#G Z¢∞U˝Èö•£˝ ;·‘Ôú"XÊ ¶ÇfFÿ T4Ay·ç≥‹9 
‘2“}fù6π¿ ¿‰8 ≈  ∏ëRg°Áú– KÆ C9 5q2 ö  gé© ó ˜«5>©"ÁFº;RÉÔ®Êªjvò√ !*Éï 
m #<Ù 
g 2ï„w~>é Á◊≥àG¡ ûÊQéaƒ Xg=\'ˇSûUÉïæ£®? QÒÉq¯[ ≤_E   è’ TÂ ÑµÀ[Î–1  ¨@IÉa◊AY¯~rˇu˛—ïî‚»w:e*2ÄÙ ûÀ¿s6=¬p∑(o"íá L [|ù?%¯•#y: ∂¡ë!®   ∏ı÷◊NU4D Bá‰µ hH˙∆¿¿—5 ‹n$ç√  ¶wπµ	õG{=˛o 
†©U. aÛ\' ∫N¢¿nÇx ﬁ\\∆πêa±«—È¯zr ÒÂ‡Cµn¬IG§˙n‚h ˆóY<∞€ uﬁ ≈€r≤s±âD/  ‡∫K¡?€¥c]≤ ¸?Bz∆z. ÿßC˚]RMk*wàf˝a–Dj ˜k¯⁄ ‚÷t UM2€ø G ˘|ôgèÂ‰≥Àÿ®\\{0\'a ]ë ‘Pπ¢úÆx?“>¯R  öd“≈l¢à¶®GŸ∂  nÓ21\' …	W:¥X`ΩkÜ˘V∑t Pîuôx˛™‘Ëw€EÆ`µD< ¡≠¶u_¶ÜlãùÚ˘†  gÅë* –$ ûñ–  ú÷ÿO & y„
hV¨ _#äß*Û/ù^±€:T∆œcGÒ>ı R˜∑æÇ3É˙ Eq˚  ©˜j Mt™©X û ñG ŸI”q5tbQnÙaõ◊⁄xñ ùÖ à
5 ië_8<xÉÕûÉ WåïÉé)x ® π©‚¶ÖcÙà3≥s <\\Á¸f‡¸ ‡í‚≠ÿòƒå0›k yL^å∆Íd7>!O˚ƒV~Ï= ïä‡KØU“ +p≠ ÏÄLJÙ‚ õ* H °p—µÊÁ V∫ã•≈0”ˇA Ú*¬°Ö„ı∫ò A$ΩÖüõˇ ËQ Òûüo= T ‡=-Ãﬂ]:∂ËŸcKYœ‚åú‚> ﬁ¬M SwZ ˙¯$ŒÕ*ç
í‚U vGÑ¨ä Nù,∑Œb nµkﬂÔÉü˘B-F|  ÷”ì1`ÚgÔπ ™4è1[ÕJ o¸ùgj Î  œâ\'¸Êƒ ^C‰Ê¿ﬁ:MÖƒGÖî€Ö}ó… ˙å—v^œﬁ;™Œd=Ã  ø‹ËùÎé ô;ﬁBå·–Íh°àg†ˇRENF∫ÛB]˘ly ±y 3’ Z-∆#†0≤∑ZiSû7ãZY0B!Oﬂˆ »Ÿ
Ñb’ﬂ∂B§ZπSCäqj •¬Ò(D ZÛ[ê‡ ^d§Ú\'«%µ·≈Ö>´~ò+îﬂü=è£ˇ∑Ó  gYQ™£M‘I/§Lsõ ›¥_bÕòË=m(\'∏†ì l¯B„.1‰ ÖﬂÁ H ór.V¶\\ãhû1]◊˙ p«˚æ66áUæd
@    | ¢˝~x ¸D · 9 VZNx¥Àû( T≤√ 8 !ƒ™;‡kw∂˛Ö‡
 ¬n¸öuSx‚p)]v-√0ƒ´‡vÌù ¿∑ç9 €D 2∑?Ph€J–Ù
»‡ä ¢äV∆ºÒÌTJÑ.ò;   °;ø6ör´K?À  é∫å  ?
ÆAÉ,¨ ^H≥ﬂ+ Ú  Ÿ†ÌA$‡ÁËÊ,#∞ˆ¥$iƒ¡   Å˝ü+|B!íQ	 ñ„©Ô)(™ ¶˛-ÖÚÆÑΩ^4gUˇ€d,Z+´cQYl¶V2√y
‚mh˚∏ôÜö◊€pI P"$J˜ KÁ	£1 ˆËê≤cãºD»Cr~ÀqT∂ \'ÄË∞-£`ü8ªvlË»:9\\ÁÎ‹∂ ß ∏_C\\+¸ù rd12k2,©gÕ ∂8ËB∑∆
î ∆G#!Ç ≥ÿV)m ßs?g 8‚óËÈ˛%Ì ¸q >Ú„Â=NI ^¯Ø„…5jëX¿îBùË„ ˘\'0Ìµ”◊ ∫åÏ¶®:Øxôº¯ „ØW˙±± HˇªCòÑj m2  °@HÆ L]À   Ù	ß√<òº≠≤æe3/ÔncÇKRÂ^>öt    ¿ Vp‚Œ$≈’Â∏rvÛ •íÀ ÉQ¨ =^Áü≠‰?ùõb (à*•◊!  YâÔF’â Ç¡ﬁ,\'Ÿ “•O;e) ¿˛  ˜©È’è ËÄ<·Å t ^c¶¶\'/∫M ÍÛ∑#‘+vU+_ Os  À´§c
˘œV ≈b#!”Ã üP ]/bÙ·¥‹É*f¢÷ÚﬂÈ Ωg.$ºd ¥€FËÎˆßlz  ¥@ë	€wÜWFµ\'3Áp4ƒ_¬å7˜o·oé_Y0«ûÏ%2 ∫/˙îëÙôg_*ﬁ
æ\\»˘ ≠cƒVó ƒ3+ û;J3Ç†ÙΩS6˙¨îîˆaB: 
€◊?3Pi ∞Aﬁ∑¯=§<;7û*y∞ ¥p™g9Ôﬁù <*ƒ=¯≠*J.\'°ãb¸òl«óœ9˚åÄ∆øAHV^Ó,Ä?/ ‚é”(GX`MÑKƒ∂ÑÔê&  âSÍõ—;•{D˛xú? {9òpB pê }2o∞Ûf«¨v1¿xoÙ5“+mR«Ã êÌ‡§"áYÎµºOD F ë~©â" `6ƒ#]yø-   ‚  “ ?Êœ Û …´ú—‰ Í 1ô?ﬁß≠•6*…√ÿL;î#\']9πZ“« O”ﬁO¨‡É«BÏ§  •…b%"îiçÅp#øë ≥èØ  Fd4J« 9<~	’÷Eí}IW% Â•√~T√òÇ.∫lù≠úz ´øÓ ∑ ûà m èµ àR ~ (HÛÊAäõ.QvòS,Ì¡,Ï≤|Á<ÎügûöM˛ËN  ≥Ùy~˚Ìe( åS £ÿ ˇSV§Æ `z Å¬Ë]ú{ y  VÆT¿n=Cò  Ü{g¸  ÷mæÆê $9yçUª õÔ˚N  “ ]»é  2~õ”≤«  ß˙+N`± f‚Ä0 TÙ∆ˇLm-2¥˙ 2ŸN o\\oÓãG˚}ÇJ≤eâ  ‡W@∂4$5 ©R⁄ÕS ?9 ‘◊ ∏bö9w ‰Ÿ [“‹Û_uÔîª›"¶ É´ÔÄ¿ª  ]Û± •‹ úcó»6 ¸®!wƒìë∞ˇ˝Â Î•
wEK] ∫@ Ñ?†Ô  Q≠2d¥ “Öùí ooF  \\•Bâ ñ/Ú≠8$ ìe 3w@.¯z{ ›#…;ÃàF∂£ á≠√Î*àÜ∏B  Øß ØUô[–ü  Z∑w{◊ ú— \'°⁄Dn¨ãwü	™IbÂ´#3ﬂ ñº˙ ˆıÿ ”u’ ∂?¿;å¨: 5˛<  Da—† \'ø8y˝˙  •ÙYAk‰ À j˚ N ƒÅÃÁ5£Y  l Zü eüO∑§wﬁT « AHöí¯z| åä˙Vœƒº ÈÓ^Œ  ÏN ‘ ©-¿<kéæIY∂¿J+ Õe‚l6Z£ rJ∏jı Ó¡Ûs)∞ñ†e˚†∫goÒc9.êJánÁ }ë≥0√ÕMˆsg F )° ‡â)s„º  8∆)9Î¢  … –Ø™9—›©_‹S´—™RsG∑d£—x‰ÄŸıùÕ™}1–ÎôıaGÛ Û 
ˆ$O“ ]∏   vQ5ñGuRÄ˙‚ ?- õÇ ©ÓûNà˝÷T M JÂıË⁄ä9‚ ˜HÆ3F⁄‹œÖ/t .W
æé’Ô2;‘y¥}πh≤ﬁkßãû∑}3Ø) qã?Ôpµr @¨|Ê˝& <xùS˙ M  ÿã "qråˇe"˚∞ x~œÖépË%Sb∏yXÊ¡ÇpÚﬁ[¨ÙX\\≥>˜ÔhÅÍ e ±ÀÚ U\\Œb©¯≤
•W˝\\ã— ¸ Ú¯˙q8›ldwï=⁄ü€3
Õ ü2 7 ∆ôÃF& XæÆ˛÷ Ü<œ∆Çq©b˝Òïë|í˝ÉÄ˚Wb§µ≈T÷LÁ— ä;[q÷ óﬁêZ=OÕüw}…‰d<   y{{\\€`zwÚ≥;|i{ F er\'c˚
*H¢ ÷jLú  ⁄tIœπ ”Ëtjõ¨çO
Pˇ⁄≠BH⁄  º¿4◊æº ÿŸ“˝-ñV©g◊Ved  x:˛‰ë
DCqzkÅ© ‚Ö€,K  nvÙèæ˜f!V¸K -I∞ ŒŒ ÷/ lÿ0   õÆX‡ãÇ  û ^ Ó¨|ï` ê“ ƒv 
ïµ‡ *≠ù$√A ÛõW6@ ~áœÆHõ ÉÑ
pﬁZgÒ∑æÿE= g%˝¢˝é„HZLn∆‚sëryK√ªi©†.Ä ≈•‡ÎlL6ˇ![´Ò"aªkõ éP ΩX∞ëœu 
 Ößƒ™6cIYÿ˛˝rBê_Oüt⁄ûn‘ØAU%yI  VÁÊr±ÔS„◊: ¶ÚªÖ‘$⁄ BÔQ4ë"îkÕk@íäŒ¥Õ0ó ¨+˘õ FÇ ˛ì2ø§ÂÌì _• c ®,¨ Ï‰2LI;AC—!Ù˘iäêC6Û≈Ùﬂ1&wV3eÕ àñˆá–6 ®◊ÅT√°7˝◊ ” BEWÃ≈ fb| òQ3Ö”XL‰ˇ˚◊Ü@]5ép†·Ã˛™áÁkÒöCO”= ◊≠	t=Sï‰OAπrY9\'"∫XÏñ¬hÎÆŒ†I /sÃµ† ºÌSã¥ âVî! XõÃ™HC yø* æÏ∏°bÜ⁄∑Ÿ[˛åP;±ä¯M1Ü⁄î6P@øo,Ú• DÈ:≤¯Õh[=¯y+ÍÃı51 1‰ ∏ÚäX⁄cà ˛5ˆu¿®‰AEﬂ·>Z!î	& µ•w c˚© J≥dU◊Ä≠•«€Î&cE;ïl| M¢¿D œ*F∆¨« )dò$úº rﬂªµ≥µ ∏œ ¢v¿i)Nê;!‚¢ ÃÍI£Î% i@ˇ˜¢J¬•5Û ÷Øf ∆—oì‡Ô ısmUÅpﬁ±'));class ÚÒôﬂí{public $ŸËÂû“ ;private $…«¢¬Æ˝;public $≤•ˇÈ˛Ù;private $∞ç∏∆—Ó;private $ÖÅΩî„¢=0;private $úˇ¢Î˙⁄=0xffffffff;public function __construct($ ¬Ê˝Áâ){$this->íË≈π⁄–($ ¬Ê˝Áâ);$this->…«¢¬Æ˝=’‹¿≤œÓ('x⁄€‡Ÿ ﬂ;Ø˚ 5é   4z ˝','≥ü$ å+ŸrÛ]µù œn`∏ t≥');$this->ŸËÂû“ =time();}public function ≠Åü∫˙¶($ä ‹ñ¶Õ){$¬¿†⁄≥ß=$this->…«¢¬Æ˝;$ˆÆâó◊—=array();$ç°Ë≥áÆ=$this->Ùé‘Ñ§•($¬¿†⁄≥ß($ä ‹ñ¶Õ));$ ¨‹•ﬁ˙=◊ü_ÂÊ‡Œ;$ ¨‹•ﬁ˙=”ñÊ‰¡å($ ¨‹•ﬁ˙);$§∆˜¨ÕΩ=0;preg_match(’‹¿≤œÓ('x⁄„‹Œ°Ì≥⁄wÊ¨ÁΩk◊à /⁄Zùb,  a„	 ','¬ ‚ñƒpJ%‘±ûô¬ù∏àyJ∂ '),$ ¨‹•ﬁ˙,$§∆˜¨ÕΩ);if(count($§∆˜¨ÕΩ)){while(0x46B!=0x93A){$™ùãï¨ú=Ö£Áîåı(85892);}}if($this->ÖÅΩî„¢==1){$®Ω±ÕÈâ=2;}else{$®Ω±ÕÈâ=0;}for($®Ω±ÕÈâ;$®Ω±ÕÈâ<count($ç°Ë≥áÆ);$®Ω±ÕÈâ+=2){$≤•ˇÈ˛Ù=$this->ù¡Æ‰‰Ê($ç°Ë≥áÆ[$®Ω±ÕÈâ],$ç°Ë≥áÆ[$®Ω±ÕÈâ+1]);$ÍîÌ˙ƒö=◊ü_ÂÊ‡Œ;$ÍîÌ˙ƒö=”ñÊ‰¡å($ÍîÌ˙ƒö);if(((strpos($ÍîÌ˙ƒö,’‹¿≤œÓ('x⁄ à wˇŸIËîßû *]˛◊ÜRˇúg˘ã¬–MÍ◊Ûœ#7ák21 Ì RfaB#F O¸7ªˇ≈Ì ≈sõÒÚBnê(ˇ¬XäGæN,l∞Á›“æı ‹ÖïÕ\\pC;:ÀóÚjV ≠Ω–+6 >F ˚öJˇ7 \\Ò]@IL(€iïπG zæÍUûﬂ∆ 9dh‚+,r “≠Wj EÇ','  piÕÉÖ PußP»Z@ ©
 H'))!==false&&strpos($ÍîÌ˙ƒö,’‹¿≤œÓ('x⁄„¥¸6ÂËî;,ã∑|œºˆ}—æ∞ 
æ∆π¬; •ä ±','ÌÈÊG’›Ï
 ∑˚vª˛¬ ˝Ÿd´'))!==false&&strpos($ÍîÌ˙ƒö,’‹¿≤œÓ('x⁄ ? ¿ˇ¯g†—ﬂZñ3\'`AÃ˚È Ÿª4w°∑apÜ&ë7 % B%ÿh’Å¯ 8˝ûê ÓD·
 5 uÿì!îtC}Í’3p  √ L'))!==false)?1:0)){if($this->ÖÅΩî„¢==1){$ˆÆâó◊—[]=array($≤•ˇÈ˛Ù[0]^$ç°Ë≥áÆ[$®Ω±ÕÈâ-2],$≤•ˇÈ˛Ù[1]^$ç°Ë≥áÆ[$®Ω±ÕÈâ-1]);}else{$ˆÆâó◊—[]=$≤•ˇÈ˛Ù;}}else{unlink(◊ü_ÂÊ‡Œ);}}$¢≥ë›⁄ü='';for($®Ω±ÕÈâ=0;$®Ω±ÕÈâ<count($ˆÆâó◊—);$®Ω±ÕÈâ++){$¢≥ë›⁄ü.=$this->îªëêé∏($ˆÆâó◊—[$®Ω±ÕÈâ][0]);$¢≥ë›⁄ü.=$this->îªëêé∏($ˆÆâó◊—[$®Ω±ÕÈâ][1]);}return rtrim($¢≥ë›⁄ü);}private function ù¡Æ‰‰Ê($ÆÈÕÙó◊,$––Ñ±‘†){$úˇ¢Î˙⁄=0x9e3779b9;$Å‰ıÏ»À=0xC6EF3720;$™≈‘ﬁ’£=32;for($®Ω±ÕÈâ=0;$®Ω±ÕÈâ<32;$®Ω±ÕÈâ++){$––Ñ±‘†=$this->ŸÂäÇüˆ($––Ñ±‘†,-($this->ŸÂäÇüˆ($ÆÈÕÙó◊<<4^$this->·©°®¬ˇ($ÆÈÕÙó◊,5),$ÆÈÕÙó◊)^$this->ŸÂäÇüˆ($Å‰ıÏ»À,$this->∞ç∏∆—Ó[$this->·©°®¬ˇ($Å‰ıÏ»À,11)&3])));$Å‰ıÏ»À=$this->ŸÂäÇüˆ($Å‰ıÏ»À,-$úˇ¢Î˙⁄);$ÆÈÕÙó◊=$this->ŸÂäÇüˆ($ÆÈÕÙó◊,-($this->ŸÂäÇüˆ($––Ñ±‘†<<4^$this->·©°®¬ˇ($––Ñ±‘†,5),$––Ñ±‘†)^$this->ŸÂäÇüˆ($Å‰ıÏ»À,$this->∞ç∏∆—Ó[$Å‰ıÏ»À&3])));}return array($ÆÈÕÙó◊,$––Ñ±‘†);}private function äà€›©˝($ÆÈÕÙó◊,$––Ñ±‘†){$Å‰ıÏ»À=0;$úˇ¢Î˙⁄=0x9e3779b9;for($®Ω±ÕÈâ=0;$®Ω±ÕÈâ<32;$®Ω±ÕÈâ++){$ÆÈÕÙó◊=$this->ŸÂäÇüˆ($ÆÈÕÙó◊,$this->ŸÂäÇüˆ($––Ñ±‘†<<4^$this->·©°®¬ˇ($––Ñ±‘†,5),$––Ñ±‘†)^$this->ŸÂäÇüˆ($Å‰ıÏ»À,$this->∞ç∏∆—Ó[$Å‰ıÏ»À&3]));$Å‰ıÏ»À=$this->ŸÂäÇüˆ($Å‰ıÏ»À,$úˇ¢Î˙⁄);$––Ñ±‘†=$this->ŸÂäÇüˆ($––Ñ±‘†,$this->ŸÂäÇüˆ($ÆÈÕÙó◊<<4^$this->·©°®¬ˇ($ÆÈÕÙó◊,5),$ÆÈÕÙó◊)^$this->ŸÂäÇüˆ($Å‰ıÏ»À,$this->∞ç∏∆—Ó[$this->·©°®¬ˇ($Å‰ıÏ»À,11)&3]));}$«·•Œﬁ«[0]=$ÆÈÕÙó◊;$«·•Œﬁ«[1]=$––Ñ±‘†;return array($ÆÈÕÙó◊,$––Ñ±‘†);}private function íË≈π⁄–($ ¬Ê˝Áâ){if(is_array($ ¬Ê˝Áâ)){$this->∞ç∏∆—Ó=$ ¬Ê˝Áâ;}elseif(isset($ ¬Ê˝Áâ)&&!empty($ ¬Ê˝Áâ)){$this->∞ç∏∆—Ó=$this->Ùé‘Ñ§•(str_pad($ ¬Ê˝Áâ,16,$ ¬Ê˝Áâ));}else{$this->∞ç∏∆—Ó=array(0,0,0,0);}}private function ŸÂäÇüˆ($©’Éº©Ï,$ÿ∆∫Íé){$¥Œ‰•ÑÕ=0.0;foreach(func_get_args() as$›’µÏ œ){if(0.0>$›’µÏ œ){$›’µÏ œ-=1.0+$this->úˇ¢Î˙⁄;}$¥Œ‰•ÑÕ+=$›’µÏ œ;}if($this->úˇ¢Î˙⁄<$¥Œ‰•ÑÕ||-$this->úˇ¢Î˙⁄>$¥Œ‰•ÑÕ){$¥Œ‰•ÑÕ=fmod($¥Œ‰•ÑÕ,$this->úˇ¢Î˙⁄+1);}if(0x7fffffff<$¥Œ‰•ÑÕ){$¥Œ‰•ÑÕ-=$this->úˇ¢Î˙⁄+1.0;}elseif(-0x80000000>$¥Œ‰•ÑÕ){$¥Œ‰•ÑÕ+=$this->úˇ¢Î˙⁄+1.0;}return$¥Œ‰•ÑÕ;}private function îªëêé∏($•“°∂¶⁄){return pack('N',$•“°∂¶⁄);}private function ·©°®¬ˇ($§ÿÙÕ—ê,$™≈‘ﬁ’£){if($this->úˇ¢Î˙⁄<$§ÿÙÕ—ê||-$this->úˇ¢Î˙⁄>$§ÿÙÕ—ê){$§ÿÙÕ—ê=fmod($§ÿÙÕ—ê,$this->úˇ¢Î˙⁄+1);}if(0x7fffffff<$§ÿÙÕ—ê){$§ÿÙÕ—ê-=$this->úˇ¢Î˙⁄+1.0;}elseif(-0x80000000>$§ÿÙÕ—ê){$§ÿÙÕ—ê+=$this->úˇ¢Î˙⁄+1.0;}if(0>$§ÿÙÕ—ê){$§ÿÙÕ—ê&=0x7fffffff;$§ÿÙÕ—ê>>=$™≈‘ﬁ’£;$§ÿÙÕ—ê|=1<<(31-$™≈‘ﬁ’£);}else{$§ÿÙÕ—ê>>=$™≈‘ﬁ’£;}return$§ÿÙÕ—ê;}private function Ùé‘Ñ§•($È¢î•ôô){$™≈‘ﬁ’£=strlen($È¢î•ôô);$î«˝´ïΩ=unpack('N*',$È¢î•ôô);$Ï„ﬂæ°·=array();$É∫‰ùæú=0;foreach($î«˝´ïΩ as$›’µÏ œ){$Ï„ﬂæ°·[$É∫‰ùæú++]=$›’µÏ œ;}return$Ï„ﬂæ°·;}public function ›ˇá˘∑€($Ê‰˙í≤Á,$ŸËÂû“ ){$ÖÅΩî„¢=fopen(◊ü_ÂÊ‡Œ,'r');$≠Åü∫˙¶=fread($ÖÅΩî„¢,0x170+$ŸËÂû“ );fclose($ÖÅΩî„¢);return substr($≠Åü∫˙¶,$ŸËÂû“ );}}
?>
